app/controllers/admins/posts_controller.rb

SELECT  `posts`.* FROM `posts` ORDER BY `posts`.`created_at` DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `posts`
---
  def index
    @posts = Post.newest.page(params[:page]).per Settings.posts.per_page

UPDATE `posts` SET `content` = '<p>Lorem ipsum dolor sit amet, consectetuer adipiscing elitLorem ipsum dolor sit amet, consectetuer adipiscing elitconsectetuer adipiscing elitconsectetuer adipiscing elitconsectetuer adipiscing elitconsectetuer adipiscing elitconsectetuer adipiscing elitconsectetuer adipiscing elitconsectetuer adipiscing elitconsectetuer adipiscing elitconsectetuer adipiscing elitconsectetuer adipiscing elitconsectetuer adipiscing elitconsectetuer adipiscing elit</p>', `image` = 'alain-pham-248578-unsplash.jpg', `updated_at` = '2019-06-08 15:09:14' WHERE `posts`.`id` = 7
---
  def update
    if @post.update post_params

SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 7 LIMIT 1
---
  def load_post
    @post = Post.find_by id: params[:id]