app/views/posts/show.html.erb

SELECT COUNT(*) FROM `comments` WHERE `comments`.`post_id` = 7
---
			</div>
			<% if @post.comments.count > 0 %>