app/controllers/comments_controller.rb

  def create
    @comment = @post.comments.new comment_params

    if @comment.save
---
INSERT INTO `comments` (`user_name`, `content`, `post_id`, `created_at`, `updated_at`, `email`) VALUES ('Josh Tran', 'This is a comment of testing comments', 7, '2019-06-08 07:14:10', '2019-06-08 07:14:10', 'boygirlsroyal@gmail.com')

  def load_post
    @post = Post.find_by id: params[:post_id]
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 7 LIMIT 1