app/controllers/posts_controller.rb

SELECT  `posts`.* FROM `posts` ORDER BY `posts`.`created_at` DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `posts`
---
  def index
    @posts = Post.publish.newest.page(params[:page]).per Settings.posts.user_per_page

SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 7 LIMIT 1
SELECT  `comments`.* FROM `comments` WHERE `comments`.`post_id` = 7 LIMIT 6 OFFSET 0
SELECT COUNT(*) FROM (SELECT  1 AS one FROM `comments` WHERE `comments`.`post_id` = 7 LIMIT 6 OFFSET 0) subquery_for_count
---
  def show
    @post =
      if current_admin
        Post.find_by id: params[:id]
      else
        Post.publish.find_by id: params[:id]
      end
    @recent_posts = Post.publish.newest.limit(Settings.posts.recent_page)
    @comments = @post.comments.page(params[:page]).per Settings.posts.recent_page