app/controllers/static_pages_controller.rb

  def home
    @posts = Post.newest.limit 6
---
SELECT  `posts`.* FROM `posts` ORDER BY `posts`.`created_at` DESC LIMIT 6